In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
ls

 Volume in drive C has no label.
 Volume Serial Number is CAB5-589B

 Directory of C:\Users\ADMIN\Documents\lokesh_demos_&_diy\day 70

02/13/2024  11:24 AM    <DIR>          .
02/13/2024  11:24 AM    <DIR>          ..
02/13/2024  11:23 AM    <DIR>          .ipynb_checkpoints
02/13/2024  11:24 AM             2,127 AdaBoost Implementation.ipynb
12/11/2019  02:17 AM             3,258 gender_submission.csv
12/11/2019  02:17 AM            28,629 test.csv
12/11/2019  02:17 AM            61,194 train.csv
               4 File(s)         95,208 bytes
               3 Dir(s)  168,016,683,008 bytes free

In [5]:
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

In [6]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [11]:
df = pd.concat([train,test],sort=False)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [13]:
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [14]:
df = df.drop("Cabin", axis = 1)

### Handling Missing Values using SimpleImputer

In [16]:
from sklearn.impute import SimpleImputer

In [19]:
# Mean()
print(f"Number of null value before impute : {df.Age.isnull().sum()}")
si = SimpleImputer(strategy="mean")
df["Age"] = si.fit_transform(df[["Age"]])
print(f"Number of null value after impute : {df.Age.isnull().sum()}")

Number of null value before impute : 263
Number of null value after impute : 0

In [43]:
# Most_frequent()
print(f"Number of null value before impute : {df.Survived.isnull().sum()}")
si = SimpleImputer(strategy="most_frequent")
df["Survived"] = si.fit_transform(df[["Survived"]])
print(f"Number of null value after impute : {df.Survived.isnull().sum()}")

Number of null value before impute : 0
Number of null value after impute : 0

In [44]:
# Most_frequent()
print(f"Number of null value before impute : {df.Fare.isnull().sum()}")
si = SimpleImputer(strategy="mean")
df["Fare"] = si.fit_transform(df[["Fare"]])
print(f"Number of null value after impute : {df.Fare.isnull().sum()}")

Number of null value before impute : 1
Number of null value after impute : 0

In [51]:
df.Embarked=df.Embarked.fillna("N")

In [52]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [53]:
print(*df.columns, sep = " , ")

PassengerId , Survived , Pclass , Name , Sex , Age , SibSp , Parch , Ticket , Fare , Embarked

In [54]:
df = df.drop(['Name',"Ticket"],axis = 1)

In [67]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1       0.0       3    male  22.0      1      0   7.7500        S
1            2       1.0       1  female  38.0      1      0  56.9292        N
2            3       1.0       3  female  26.0      0      0   7.9250        N
3            4       1.0       1  female  35.0      1      0  53.1000        N
4            5       0.0       3    male  35.0      0      0   8.0500        N

### Checking Outliers

In [60]:
threshold = 3

from scipy.stats import zscore
numerical_feature = ["Fare","Age"]
zscore = np.abs(zscore(df[numerical_feature]))
zscore.head()

       Fare       Age
0  0.503595  0.611972
1  0.734503  0.630431
2  0.490544  0.301371
3  0.382925  0.397481
4  0.488127  0.397481

In [66]:
outlier = np.where(zscore>threshold)
outlier

(array([  27,   88,   96,  116,  118,  258,  299,  311,  341,  377,  380,
         438,  493,  527,  557,  630,  672,  679,  689,  700,  716,  730,
         737,  742,  745,  779,  851,  915,  944,  950,  955,  960,  965,
         966,  972,  987, 1005, 1033, 1047, 1075, 1093, 1109, 1215, 1234,
        1266, 1298], dtype=int64),
 array([0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0,
        0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0], dtype=int64))

### Removing Outliers

In [63]:
from scipy.stats.mstats import winsorize

In [65]:
df.Fare = winsorize(df.Fare,limits= [0.15,0.15])
df.Age = winsorize(df.Age,limits= [0.15,0.15])

In [69]:
outlier = np.where(zscore>threshold)
outlier  # Now Zero Outliers

(array([], dtype=int64), array([], dtype=int64))

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     1309 non-null   float64
 2   Pclass       1309 non-null   int64
 3   Sex          1309 non-null   object
 4   Age          1309 non-null   float64
 5   SibSp        1309 non-null   int64
 6   Parch        1309 non-null   int64
 7   Fare         1309 non-null   float64
 8   Embarked     1309 non-null   object
dtypes: float64(3), int64(4), object(2)
memory usage: 102.3+ KB

In [71]:
from sklearn.preprocessing import OrdinalEncoder
ordinal = OrdinalEncoder()

In [78]:
df['Sex'] = ordinal.fit_transform(df[['Sex']])
df['Survived'] = ordinal.fit_transform(df[['Survived']])
df['Embarked'] = ordinal.fit_transform(df[['Embarked']])
df.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1       0.0       3  1.0  22.0      1      0   7.7500       1.0
1            2       1.0       1  0.0  38.0      1      0  56.9292       0.0
2            3       1.0       3  0.0  26.0      0      0   7.9250       0.0
3            4       1.0       1  0.0  35.0      1      0  53.1000       0.0
4            5       0.0       3  1.0  35.0      0      0   8.0500       0.0

In [79]:
data = df.copy()

In [81]:
x = df.drop("Survived",axis = 1)
y = df['Survived']

In [82]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(x, y,train_size=0.7,random_state=0)

In [117]:
from sklearn.ensemble import AdaBoostClassifier
adaboost = AdaBoostClassifier(n_estimators=5, learning_rate=0.1, random_state=42)
adaboost.fit(x_train,y_train)

AdaBoostClassifier(learning_rate=0.1, n_estimators=5, random_state=42)

In [118]:
y_pred = adaboost.predict(x_test)

In [119]:
from sklearn.metrics import accuracy_score

In [120]:
accuracy_score(y_test,y_pred)

0.8727735368956743